Revit 2027 API
RebarConstrainedHandle.AllowsConstraintToHostEdge Method
 Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsConstraintToHostEdge()
Public Function AllowsConstraintToHostEdge As Boolean
public:
bool AllowsConstraintToHostEdge()
member AllowsConstraintToHostEdge : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] type.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace